fustyles/Arduino/ESP32-CAM_SD_SERVO_PAGE/app_httpd.cpp
  /*
  Serial.print("SD_MMC Card Type: ");
  if(cardType == CARD_MMC){
      Serial.println("MMC");
  } else if(cardType == CARD_SD){
      Serial.println("SDSC");
  } else if(cardType == CARD_SDHC){
      Serial.println("SDHC");
  } else {
      Serial.println("UNKNOWN");
  }
  */
  
  String path = "/"+timestamp+".jpg";

  fs::FS &fs = SD_MMC; 
  Serial.printf("Picture file name: %s\n", path.c_str());

  File file = fs.open(path.c_str(), FILE_WRITE);
  if(!file){
    Serial.println("Failed to open file in writing mode");
  } 
  else {
    file.write(fb->buf, fb->len);
    Serial.printf("Saved file to path: %s\n", path.c_str());
  }
  file.close();
  
  file = fs.open(path.c_str());
  Serial.println("File Size = " + String(file.size()));
  
  if (file.size()==0) {
    Serial.println("Failed.");
    /*
    file.close();
    
    Serial.println("Try again...");

    file = fs.open(path.c_str(), FILE_WRITE);
    if (file) {
      file.write(fb->buf, fb->len);
      file.close();
    
      file = fs.open(path.c_str());
      Serial.println("File Size = " + String(file.size()));
      if (file.size()==0) {
        Serial.println("Failed.");
      }
    }
    else {
      Serial.println("Failed.");
    }
    */
  }
  else {
    Serial.println("Success.");
  }
  
  file.close();

  /*
  Serial.printf("SD_MMC Card Size: %lluMB\n", SD_MMC.cardSize() / (1024 * 1024));
  Serial.printf("Total space: %lluMB\n", SD_MMC.totalBytes() / (1024 * 1024));
  Serial.printf("Used space: %lluMB\n", SD_MMC.usedBytes() / (1024 * 1024));
  */
  
  SD_MMC.end();

  Serial.println("");  

  pinMode(4, OUTPUT);
  digitalWrite(4, LOW);  
}
